clc
clear all
[k,Z,K,M]=kout;
I=0:0.1:10;
ph=7; 
p=20; %so2
Ryear=600; %降水量
Q(1)=45; %第一周生物质总量
d=0.002; %死亡率相关
k1=0.005; %ph值相关
k2=0.001; %so2相关
% k3=0.05; %生长率相关
k33=[-5197.06869	-5200.109013	-5240.049923	-4850.183921	-4910.703985	-5000.255458	-5074.7468	-5215.991418	-5287.486352	-5387.008978	-5130.175601	-4887.262778	-5200.521912]; %生长率相关
k31=[642.147527213199,708.881862585287,671.458929287668,671.797270305606,670.158321058746,715.333298765564,713.049895766768,730.072925490723,561.489831506271,655.590019078217,541.657865161800,651.437405298085,707.214820534002];
k32=[1236.41423918498,1131.61486673212,1017.24106987088,847.983438797626,628.801872963163,625.255213118625,659.114240121925,898.743091658450,957.155663239176,1102.13277451628,1214.84528607011,1243.40066914061,989.803662467848];
theta1=20; %标准差
theta2=20; %
mu = 0;  % 均值
sigma1 = 200;  % 标准差
sigma2 = 150;  % 标准差
sigma3 = 150;  % 标准差
K33=[k33+300,k33+300,k33+300,k33+300,k33+300,k33+300,k33+300,k33+300,k33+300];
K32=[k32,k32,k32,k32,k32,k32,k32,k32,k32];
K31=[k31,k31,k31,k31,k31,k31,k31,k31,k31];
noise1 = mu + sigma1*randn(size(K33));  % 生成高斯噪声
noise2 = mu + sigma2*randn(size(K32));  % 生成高斯噪声
noise3 = mu + sigma3*randn(size(K31));  % 生成高斯噪声
K33=K33+noise1;
K32=K32+noise2;
K31=K31+noise3;
if Ryear<=400
    deltaT=-0.48.*(400+Ryear)./400-0.28;
elseif Ryear<=800
    deltaT=-0.62.*(400+Ryear)./400;
else
    deltaT=-0.86.*Ryear./400-0.14;
end
for t=2:840
    G1(t)=1+10/(theta1.*(2.*pi)^(1/2)).*exp(-(t-50).^2./(2*theta1^2));
    G2(t)=1-10/(theta2.*(2.*pi)^(1/2)).*exp(-(t-50).^2./(2*theta2^2));
% G1(t)=1;
% G2(t)=1;
%     T(t)=37+deltaT;
%     alpha(t)=0.1-exp(-260./Q(t-1)); %反照度
%     beta(t)= 1./(1+exp(-Q(t-1)/300));%土壤含水量系数
%     gamma(t)=1./1+(exp(-T(t).*Q(t-1)./(T(t)+10))); %大气湿度系数
    T(t)=37;
    alpha(t)=0; %反照度
    beta(t)= 1;%土壤含水量系数
    gamma(t)=1; %大气湿度系数
    phi(t)=10*(1-alpha(t));
    SH(t)=60.*beta(t);
    RH(t)=50.*gamma(t);
    APD(t)=0.6111.*exp((17.27.*T(t)./(237.3+T(t)))).*(1-RH(t));
    if Ryear>200
        vp(t)=photos1(-APD(t).*phi(t)./700);
    else
        vp(t)=photos2(SH(t).*phi(t)./136);
    end
    h(t)=G2(t).*(k1.*(ph-7)^2+k2.*p)+Q(t-1).*d;
    f(t)=-G1(t).*K33(ceil(t/10)).*(vp(t)+0.1.*vp(t))/50000;
%          f(t)=G1(t).*K32(ceil(t/10)).*(vp(t)+0.1.*vp(t))/50000;
%             f(t)=G1(t).*K31(ceil(t/10)).*(vp(t)+0.1.*vp(t))/50000;
        f(t)=G1(t).*k(ceil(t/10)).*(vp(t)+0.1.*vp(t))/12.6;
%          f(t)=G1(t).*Z(ceil(t/10)).*(vp(t)+0.1.*vp(t))/12.6;
%          f(t)=G1(t).*K(ceil(t/10)).*(vp(t)+0.1.*vp(t))/12.6;
%          f(t)=G1(t).*M(ceil(t/10)).*(vp(t)+0.1.*vp(t))/12.6;
    Q(t)=Q(t-1)+Q(t-1).*(f(t)-h(t));
end
%[t,x]=ode45(@shier1,ts,x0);[t,x],
% y1=x(:,1);
% y2=x(:,2);
t=[1:1:840];

Q1=smooth(Q,50,'rloess');
% plot(t/10,Q1,'-r'),grid on;
figure(1)
yyaxis left;
% plot(t/10,Q*34615*1.53); %1
% plot(t/10,Q*529.6/6); %2
% plot(t/10,Q*901); %3

plot(t/10,Q*34615); %1
xlabel('Time(month)');
ylabel('Q(MJ)');




% legend('x(t)','y(t)');
%plot(t,y1,'-r',t,y2,'-b'),grid on,legend('x(t)','y(t)');

hold on;
% figure;
% plot(x(:,1),x(:,2)),grid on,
% xlabel('x(t)') % 在当前图形的x轴做标注
% ylabel('y(t)') % 在当前图形的y轴做标注